{
  "class_name": "Model",
  "keras_version": "1.2.2",
  "config": {
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            299,
            299,
            3
          ],
          "input_dtype": "float32",
          "sparse": false,
          "name": "input_3"
        },
        "inbound_nodes": [],
        "name": "input_3"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_189",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            2,
            2
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "valid",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "input_3",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_189"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_189",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_189",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_189"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_190",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "valid",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_189",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_190"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_190",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_190",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_190"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_191",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_190",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_191"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_191",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_191",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_191"
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "maxpooling2d_7",
          "trainable": true,
          "dim_ordering": "tf",
          "pool_size": [
            3,
            3
          ],
          "strides": [
            2,
            2
          ],
          "border_mode": "valid"
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_191",
              0,
              0
            ]
          ]
        ],
        "name": "maxpooling2d_7"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_192",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 80,
          "border_mode": "valid",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "maxpooling2d_7",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_192"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_192",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_192",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_192"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_193",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 192,
          "border_mode": "valid",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_192",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_193"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_193",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_193",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_193"
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "maxpooling2d_8",
          "trainable": true,
          "dim_ordering": "tf",
          "pool_size": [
            3,
            3
          ],
          "strides": [
            2,
            2
          ],
          "border_mode": "valid"
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_193",
              0,
              0
            ]
          ]
        ],
        "name": "maxpooling2d_8"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_197",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "maxpooling2d_8",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_197"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_197",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_197",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_197"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_195",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 48,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "maxpooling2d_8",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_195"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_198",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 96,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_197",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_198"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_195",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_195",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_195"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_198",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_198",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_198"
      },
      {
        "class_name": "AveragePooling2D",
        "config": {
          "name": "averagepooling2d_21",
          "trainable": true,
          "dim_ordering": "tf",
          "pool_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "border_mode": "same"
        },
        "inbound_nodes": [
          [
            [
              "maxpooling2d_8",
              0,
              0
            ]
          ]
        ],
        "name": "averagepooling2d_21"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_194",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "maxpooling2d_8",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_194"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_196",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 5,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 5
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_195",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_196"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_199",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 96,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_198",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_199"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_200",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "averagepooling2d_21",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_200"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_194",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_194",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_194"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_196",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_196",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_196"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_199",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_199",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_199"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_200",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_200",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_200"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "mixed0",
          "concat_axis": 3,
          "mode_type": "raw",
          "dot_axes": -1,
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "mode": "concat",
          "output_shape": null,
          "output_shape_type": "raw"
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_194",
              0,
              0
            ],
            [
              "batchnormalization_196",
              0,
              0
            ],
            [
              "batchnormalization_199",
              0,
              0
            ],
            [
              "batchnormalization_200",
              0,
              0
            ]
          ]
        ],
        "name": "mixed0"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_204",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "mixed0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_204"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_204",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_204",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_204"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_202",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 48,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "mixed0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_202"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_205",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 96,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_204",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_205"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_202",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_202",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_202"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_205",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_205",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_205"
      },
      {
        "class_name": "AveragePooling2D",
        "config": {
          "name": "averagepooling2d_22",
          "trainable": true,
          "dim_ordering": "tf",
          "pool_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "border_mode": "same"
        },
        "inbound_nodes": [
          [
            [
              "mixed0",
              0,
              0
            ]
          ]
        ],
        "name": "averagepooling2d_22"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_201",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "mixed0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_201"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_203",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 5,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 5
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_202",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_203"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_206",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 96,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_205",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_206"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_207",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "averagepooling2d_22",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_207"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_201",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_201",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_201"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_203",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_203",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_203"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_206",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_206",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_206"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_207",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_207",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_207"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "mixed1",
          "concat_axis": 3,
          "mode_type": "raw",
          "dot_axes": -1,
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "mode": "concat",
          "output_shape": null,
          "output_shape_type": "raw"
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_201",
              0,
              0
            ],
            [
              "batchnormalization_203",
              0,
              0
            ],
            [
              "batchnormalization_206",
              0,
              0
            ],
            [
              "batchnormalization_207",
              0,
              0
            ]
          ]
        ],
        "name": "mixed1"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_211",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "mixed1",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_211"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_211",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_211",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_211"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_209",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 48,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "mixed1",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_209"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_212",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 96,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_211",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_212"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_209",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_209",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_209"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_212",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_212",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_212"
      },
      {
        "class_name": "AveragePooling2D",
        "config": {
          "name": "averagepooling2d_23",
          "trainable": true,
          "dim_ordering": "tf",
          "pool_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "border_mode": "same"
        },
        "inbound_nodes": [
          [
            [
              "mixed1",
              0,
              0
            ]
          ]
        ],
        "name": "averagepooling2d_23"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_208",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "mixed1",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_208"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_210",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 5,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 5
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_209",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_210"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_213",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 96,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_212",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_213"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_214",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "averagepooling2d_23",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_214"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_208",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_208",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_208"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_210",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_210",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_210"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_213",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_213",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_213"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_214",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_214",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_214"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "mixed2",
          "concat_axis": 3,
          "mode_type": "raw",
          "dot_axes": -1,
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "mode": "concat",
          "output_shape": null,
          "output_shape_type": "raw"
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_208",
              0,
              0
            ],
            [
              "batchnormalization_210",
              0,
              0
            ],
            [
              "batchnormalization_213",
              0,
              0
            ],
            [
              "batchnormalization_214",
              0,
              0
            ]
          ]
        ],
        "name": "mixed2"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_216",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "mixed2",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_216"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_216",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_216",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_216"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_217",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 96,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_216",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_217"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_217",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_217",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_217"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_215",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            2,
            2
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 384,
          "border_mode": "valid",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "mixed2",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_215"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_218",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 3,
          "subsample": [
            2,
            2
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 96,
          "border_mode": "valid",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_217",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_218"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_215",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_215",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_215"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_218",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_218",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_218"
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "maxpooling2d_9",
          "trainable": true,
          "dim_ordering": "tf",
          "pool_size": [
            3,
            3
          ],
          "strides": [
            2,
            2
          ],
          "border_mode": "valid"
        },
        "inbound_nodes": [
          [
            [
              "mixed2",
              0,
              0
            ]
          ]
        ],
        "name": "maxpooling2d_9"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "mixed3",
          "concat_axis": 3,
          "mode_type": "raw",
          "dot_axes": -1,
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "mode": "concat",
          "output_shape": null,
          "output_shape_type": "raw"
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_215",
              0,
              0
            ],
            [
              "batchnormalization_218",
              0,
              0
            ],
            [
              "maxpooling2d_9",
              0,
              0
            ]
          ]
        ],
        "name": "mixed3"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_223",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 128,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "mixed3",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_223"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_223",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_223",
              0,
              0
            ]
          ]
        ],
        "name": "batchnormalization_223"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_224",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 128,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 7
        },
        "inbound_nodes": [
          [
            [
              "batchnormalization_223",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_224"
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "gamma_regularizer": null,
          "name": "batchnormalization_224",
          "epsilon": 0.001,
          "trainable": true,
          "mode": 0,
          "beta_regularizer": null,
          "momentum": 0.99,
          "axis": 3
