{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "input_dtype": null, "sparse": false, "name": "input_f9b93f25-23de-44fe-b9e0-308fbe8a786f"}, "inbound_nodes": [], "name": "input_f9b93f25-23de-44fe-b9e0-308fbe8a786f"}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 20], "trainable": true, "name": "dense_76007f0b-fd05-43a0-8bfe-fab3a0097444"}, "inbound_nodes": [[["input_f9b93f25-23de-44fe-b9e0-308fbe8a786f", 0, 0]]], "name": "dense_76007f0b-fd05-43a0-8bfe-fab3a0097444"}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_c95fd11e-dca3-4911-842f-b629a44f8d1a"}, "inbound_nodes": [[["dense_76007f0b-fd05-43a0-8bfe-fab3a0097444", 0, 0]]], "name": "dense_c95fd11e-dca3-4911-842f-b629a44f8d1a"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_95ca3959-6004-4876-b391-63bdb3536c92"}, "inbound_nodes": [[["dense_76007f0b-fd05-43a0-8bfe-fab3a0097444", 0, 0]], [["dense_c95fd11e-dca3-4911-842f-b629a44f8d1a", 0, 0]]], "name": "activation_95ca3959-6004-4876-b391-63bdb3536c92"}], "input_layers": [["input_f9b93f25-23de-44fe-b9e0-308fbe8a786f", 0, 0]], "output_layers": [["activation_95ca3959-6004-4876-b391-63bdb3536c92", 0, 0], ["activation_95ca3959-6004-4876-b391-63bdb3536c92", 1, 0]], "name": "modelc4476e8c-e3a6-42c8-a00c-c9cc734449e2"}}